In [2]:
import pandas as pd
import numpy as np

## How to handle missing data
dictionaryData = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25],"Izmir" : [40,39,38]}
weatherDataFrame = pd.DataFrame(dictionaryData)

In [6]:
print(weatherDataFrame)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [7]:
# if we delete NaN data
weatherDataFrame.dropna() # it returns a new DataFrame, original stays the same

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [8]:
weatherDataFrame.dropna(axis = 1) # axis 0 returns rows and 1 returns columns

   Izmir
0     40
1     39
2     38

In [9]:
# example for drop 2 nan
newData = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25],"Izmir" : [40,39,38], "Antalya":[45,np.nan,np.nan]}
newDataFrame = pd.DataFrame(newData)

In [10]:
print(newDataFrame)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [11]:
newDataFrame.dropna(axis = 1, thresh = 2)# it deletes 2 nan and keep others

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [12]:
# Default number for NaN
newDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [17]:
salaryDict = {"Departman" : ["IT", "IT", "Marketing", "Finance", "HR", "HR"],
             "Employees" : ["Ahmet", "Mehmet", "Onur", "Burak", "Zeynep", "Fatma"],
              "Salary" : [100,200,300,400,500,500]
             }

In [18]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [19]:
salaryDataFrame

   Departman Employees  Salary
0         IT     Ahmet     100
1         IT    Mehmet     200
2  Marketing      Onur     300
3    Finance     Burak     400
4         HR    Zeynep     500
5         HR     Fatma     500

In [21]:
groupObject = salaryDataFrame.groupby("Departman")

In [22]:
groupObject.count() # number of empoyees for each departman

           Employees  Salary
Departman
Finance            1       1
HR                 2       2
IT                 2       2
Marketing          1       1

In [23]:
groupObject.mean() # mean salary for each departman

           Salary
Departman
Finance     400.0
HR          500.0
IT          150.0
Marketing   300.0

In [24]:
groupObject.min() # min salary for each departman

          Employees  Salary
Departman
Finance       Burak     400
HR            Fatma     500
IT            Ahmet     100
Marketing      Onur     300

In [25]:
groupObject.describe() # it returns all information

          Salary
           count   mean        std    min    25%    50%    75%    max
Departman
Finance      1.0  400.0        NaN  400.0  400.0  400.0  400.0  400.0
HR           2.0  500.0   0.000000  500.0  500.0  500.0  500.0  500.0
IT           2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
Marketing    1.0  300.0        NaN  300.0  300.0  300.0  300.0  300.0